// Task_13_01_abcde_cOrNull
// Задача 13: Напишите программу, которая 
// 1. выводит третью цифру заданного числа или сообщает, что третьей цифры нет.	
// 645-> 5 
// 78 -> третьей цифры нет 
// 32679 ->6

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());