// Task_15_01_day67_weekend
// Задача 15: 
// Напишите программу, которая 
// 1. принимает на вход цифру, обозначающую день недели, и
// 2. проверяет, является ли этот день выходным.	
// 6	-> да 
// 7	-> да 
// 1 -> нет

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());